import React, {Component} from "react";
import "../../../Styles/theoryPage.css"

class RussianTheory extends Component {
    render() {
        return (
            <div className = "mainBlock">

                <div className = "arrowToLeft" width = "50px">
                    <a id = "linkLeft" href = "rustheory12" title={"Теория к предыдущему заданию"} className = "linkToTheory"><b>&#171;</b></a>
                </div>

                <span  className="theory">
                    <h1>Задание 13: Правописание НЕ и НИ с разными частями речи</h1>
                    <br/>
                    <p>Для выполнения задания необходимо знать правила слитного и раздельного написания частицы НЕ и НИ с разными частями речи.</p>
                    <ol>
                        <li>
                            <p>Частица НЕ пишется раздельно</p>
                            <table>
                            <tr>
                                <td>Часть речи</td>
                                <td>Правило</td>
                            </tr>
                            <tr>
                                <td>Существительное</td>
                                <td>1) Если есть противопоставление, выраженное союзом А.<br/>
                                2) В вопросительном предложении, подразумевающем отрицание.
                                </td>
                            </tr>
                            <tr>
                                <td>Прилагательное</td>
                                <td>1) Если есть противопоставление, выраженное союзом А.<br/>
                                    2) В вопросительном предложении, подразумевающем отрицание.<br/>
                                    3) С краткими прилагательными, у которых нет полной формы.<br/>
                                    3) С прилагательными в сравнительной степени<br/>
                                    4) С прилагательными, обозначающими вкус и цвет.<br/>
                                    5) Не + ОТНЮДЬ/ДАЛЕКО/ВОВСЕ.<br/>
                                    6) С отрицательными местоименными словами.<br/>
                                    7) С относительными и притяжательными прилагательными.
                                    </td>
                            </tr>
                            <tr>
                                <td>Глагол</td>
                                <td>Со всеми глаголами, исключение приставка -НЕДО, означающая нехваток чего-либо.</td>
                            </tr>
                            <tr>
                                <td>Причастие</td>
                                <td>1) Если есть противопоставление, выраженное союзом А.<br/>
                                2) С краткими причастиями.<br/>
                                3) С полными причастиями при наличии зависимых слов.
                                </td>
                            </tr>
                            <tr>
                                <td>Деепричастие</td>
                                <td>Со всеми деепричастиями, исключение приставка -НЕДО, означающая нехваток чего-либо.</td>
                            </tr>
                            <tr>
                                <td>Наречие</td>
                                <td>1) Если есть противопоставление, выраженное союзом А и наречие оканчивается на -е или -о.<br/>
                                2) Наречие оканчивается на -е или -о + НИЧУТЬ/ВОВСЕ/ДАЛЕКО/ОТНЮДЬ.
                                </td>
                            </tr>
                            <tr>
                                <td>Местоимение</td>
                                <td>С отрицательными и неопределенными местоимениями, если между местоимением и частицой НЕ есть предлог.</td>
                            </tr>
                            <tr>
                                <td>Союзы</td>
                                <td>С сочинительными союзами.</td>
                            </tr>
                            <tr>
                                <td>Частицы</td>
                                <td>Все частицы, кроме НЕУЖЕЛИ.</td>
                            </tr>
                            <tr>
                                <td>Предлоги</td>
                                <td>С непроизводными предлогами.</td>
                            </tr>
                        </table>
                        </li>
                        <li>
                            <p>Частица НЕ пишется слитно</p>
                            <table>
                            <tr>
                                <td>Часть речи</td>
                                <td>Правило</td>
                            </tr>
                            <tr>
                                <td>Существительное</td>
                                <td>Если к существительному можно подобрать синоним без НЕ.</td>
                            </tr>
                            <tr>
                                <td>Прилагательное</td>
                                <td>1) Если есть противопоставление, выраженное союзом НО.<br/>
                                    2) Если к прилагательному можно подобрать синоним без НЕ.<br/>
                                    3) В сочетании с прилагательными при наличии наречия меры и степени.<br/>
                                    4) В отглагольным прилагательных, образованных при помощи суффикса -ем- или -им-.<br/>
                                    5) С краткими прилагательными, если в полной форме они также пишутся слитно.
                                 </td>
                            </tr>
                            <tr>
                                <td>Глагол</td>
                                <td>Только в приставке -НЕДО, означающей нехваток чего-либо.</td>
                            </tr>
                            <tr>
                                <td>Причастие</td>
                                <td>С полными причастиями при отсутствии пояснительных слов или пояснительные слова являются наречиями меры или степени.</td>
                            </tr>
                            <tr>
                                <td>Деепричастие</td>
                                <td>Только в приставке -НЕДО, означающей нехваток чего-либо.</td>
                            </tr>
                            <tr>
                                <td>Наречие</td>
                                <td>1) В отрицательных наречиях.<br/>
                                    2)  С Наречиями оканчивающимися на -е или -о, если к ним можно подобрать синоним без НЕ.
                                </td>
                            </tr>
                            <tr>
                                <td>Местоимение</td>
                                <td>С отрицательными и неопределенными местоимениями, если между местоимением и частицой НЕ нет предлога.</td>
                            </tr>
                            <tr>
                                <td>Союзы</td>
                                <td>В составе уступительного союза.</td>
                            </tr>
                            <tr>
                                <td>Частицы</td>
                                <td>Только в частице НЕУЖЕЛИ.</td>
                            </tr>
                            <tr>
                                <td>Предлоги</td>
                                <td>С производными предлогами.</td>
                            </tr>
                        </table>
                        </li>
                        <li>
                            <p>Употребления частиц НЕ и НИ</p>
                            <table>
                                <tr>
                                    <td>Употребление частицы НЕ</td>
                                    <td>Употребление частицы НИ</td>
                                </tr>
                                <tr>
                                    <td>
                                    1) При выражении отрицания:<br/>
                                    Чуда не случилось.
                                    </td>
                                    <td>1) Для усиления отрицания.</td>
                                </tr>
                                <tr>
                                    <td>2) При двойном отрицании:<br/>
                                    Я не мог не согласиться.
                                    </td>
                                    <td>2) В придаточных предложениях с обобщённо-усилительным значением:<br/>
                                    Чем бы дите ни тешилось, лишь бы не плакало.
                                    </td>
                                </tr>
                                <tr>
                                    <td>3) В вопросительных или восклицательных предложениях при выражении подчеркнутого утверждения:<br/>
                                    Разве не правда, что мы поумнели?
                                    </td>
                                    <td>3) Для выражения запрета, приказа:<br/>
                                    Стоять и ни с места!
                                    </td>
                                </tr>
                                <tr>
                                    <td>4) При выражении неуверенности или опасения:<br/>
                                    Не пожар ли у них?
                                    </td>
                                    <td>4) В устойчивых фразеологизмах:<br/>
                                    Ни рыба, ни мясо; ни то, ни се; во что бы то ни стало; как ни в чем не бывало и др.
                                    </td>
                                </tr>
                            </table>
                        </li>
                    </ol>

                    <h5>Алгоритм выполнения задания:</h5>
                    <ol>
                        <li>Прочитайте предложение.</li>
                        <li>Определите часть речи, к которой относится слово, употребленное рядом с частицей НЕ.</li>
                        <li>Определите, какое из правил должно быть применено в данном случае.</li>
                    </ol>
                </span>

                <div className = "arrowToRight">
                    <a id = "linkRight" href = "rustheory14" title={"Теория к следующему заданию"} className = "linkToTheory"><b>&#187;</b></a>
                </div>

            </div>
        )
    }
}

export default RussianTheory