import React, {Component} from "react";
import "../../../Styles/theoryPage.css"

class RussianTheory extends Component {
    render() {
        return (
            <div className = "mainBlock">

                <div className = "arrowToLeft" width = "50px">
                    <a id = "linkLeft" href = "rustheory4" title={"Теория к предыдущему заданию"} className = "linkToTheory"><b>&#171;</b></a>
                </div>

                <span  className="theory">
                    <h1>Задание 5: Употребление паронимов</h1>
                    <br/>
                    <p>Для выполнения задания необходимо знать паронимы.</p>
                    <p>
                    Абонемент – абонент<br/>
                    Артистический – артистичный<br/>
                    Бедный – бедственный<br/>
                    Безответный – безответственный<br/>
                    Болотистый – болотный<br/>
                    Благодарный – благодарственный<br/>
                    Благотворительный – благотворный<br/>
                    Бывший – былой<br/>
                    Вдох – вздох Вековой – вечный<br/>
                    Великий – величественный<br/>
                    Восполнить – дополнить – заполнить – наполнить – переполнить – пополнить; заполнен – наполнен – переполнен<br/>
                    Враждебный – вражеский<br/>
                    Выбирать – избирать; выбирая – избирая<br/>
                    Выгода – выгодность<br/>
                    Выдача – отдача – передача – раздача<br/>
                    Выплата – оплата – плата – уплата<br/>
                    Выплатить – заплатить – оплатить – отплатить – уплатить<br/>
                    Вырастить – нарастить – отрастить<br/>
                    Выращивание – наращивание – отращивание<br/>
                    Высокий – высотный<br/>
                    Гарантийный – гарантированный<br/>
                    Гармонический – гармоничный<br/>
                    Глинистый – глиняный<br/>
                    Годичный – годовалый – годовой<br/>
                    Гордость – гордыня<br/>
                    Гуманизм – гуманность<br/>
                    Гуманистический – гуманитарный – гуманный<br/>
                    Двоичный – двойной – двойственный – двоякий – сдвоенный – удвоенный Действенный – действительный – действующий<br/>
                    Деловитый – деловой – дельный – деляческий<br/>
                    Демократичный – демократический<br/>
                    Диктант – диктат<br/>
                    Дипломант – дипломат<br/>
                    Дипломатический – дипломатичный<br/>
                    Длинный – длительный<br/>
                    Добротный – добрый<br/>
                    Доверительный – доверчивый<br/>
                    Дождевой – дождливый<br/>
                    Драматический – драматичный<br/>
                    Дружеский – дружественный – дружный<br/>
                    Единичный – единственный<br/>
                    Желанный – желательный<br/>
                    Жестокий – жёсткий<br/>
                    Жизненный – житейский<br/>
                    Жилищный – жилой<br/>
                    Загородить – огородить – оградить – отгородить – перегородить<br/>
                    Занизить – понизить – снизить<br/>
                    Зачинатель – зачинщик<br/>
                    Звериный – зверский<br/>
                    Звуковой – звучный<br/>
                    Зрительный – зрительский<br/>
                    Изобретательный – изобретательский<br/>
                    Информативный – информационный<br/>
                    Информация – информированность<br/>
                    Иронический – ироничный<br/>
                    Искусный – искусственный<br/>
                    Исполнительный – исполнительский<br/>
                    Исходный – исходящий<br/>
                    Каменистый – каменный<br/>
                    Комфортабельный – комфортный<br/>
                    Конный – конский<br/>
                    Коренастый – коренной – корневой<br/>
                    Костный – костяной<br/>
                    Красочный – красящий – крашеный<br/>
                    Лакированный – лаковый<br/>
                    Ледовый – ледяной<br/>
                    Лесистый – лесной<br/>
                    Личностный – личный<br/>
                    Микроскопический – микроскопичный<br/>
                    Мороженый – морозильный – морозный<br/>
                    Надеть – одеть<br/>
                    Наличие – наличность<br/>
                    Напоминание – упоминание<br/>
                    Невежа – невежда<br/>
                    Нестерпимый – нетерпеливый – нетерпимый<br/>
                    Неудачный – неудачливый<br/>
                    Обвинённый – обвинительный<br/>
                    Обрывок – отрывок<br/>
                    Обхватить – охватить<br/>
                    Ограничить – отграничить – разграничить<br/>
                    Оклик – отклик Органический – органичный<br/>
                    Отборный – отборочный<br/>
                    Отклонение – уклонение<br/>
                    Отклониться – уклониться<br/>
                    Отличать(-ся) – различать(-ся)<br/>
                    Отличие – различие<br/>
                    Памятливый – памятный<br/>
                    Перетерпеть – претерпеть<br/>
                    Покупательный – покупательский – покупной<br/>
                    Популистский – популярный<br/>
                    Почтенный – почтительный – почётный<br/>
                    Практический – практичный<br/>
                    Предоставить – представить<br/>
                    Представительный – представительский<br/>
                    Признанный – признательный<br/>
                    Продуктивный – продуктовый<br/>
                    Производительность – производство<br/>
                    Производительный – производственный<br/>
                    Просветительский – просвещённый<br/>
                    Публицистический – публицистичный<br/>
                    Пугливый – пуганый<br/>
                    Раздражение – раздражительность<br/>
                    Ритмический – ритмичный<br/>
                    Романтический – романтичный<br/>
                    Скрытный – скрытый<br/>
                    Словарный – словесный<br/>
                    Сопротивление – сопротивляемость<br/>
                    Соседний – соседский<br/>
                    Сравнимый – сравнительный<br/>
                    Сценический – сценичный<br/>
                    Технический – техничный<br/>
                    Удачливый – удачный<br/>
                    Униженный – унизительный<br/>
                    Фактический – фактичный<br/>
                    Хищнический – хищный<br/>
                    Царский – царственный – царствующий<br/>
                    Целый – цельный – целостный<br/>
                    Экономический – экономичный – экономный<br/>
                    Эстетический – эстетичный<br/>
                    Этический – этичный<br/>
                    Эффективный – эффектный<br/>
                    Эффективность – эффектность
                    </p>
                    <h5>Алгоритм выполнения задания:</h5>
                    <ol>
                        <li>Внимательно прочитайте предложение.</li>
                        <li>Определите контекст, в котором употреблен пароним.</li>
                        <li>Если есть несоответствие контекста предложения и паронима, замените его.</li>
                    </ol>
                </span>

                <div className = "arrowToRight">
                    <a id = "linkRight" href = "rustheory6" title={"Теория к следующему заданию"} className = "linkToTheory"><b>&#187;</b></a>
                </div>

            </div>
        )
    }
}

export default RussianTheory